import { Container } from '@mui/material';
import Box from '@mui/material/Box';
import Paper from '@mui/material/Paper';

function Home() {
    return (
        <>
        <Box sx={{ display: 'flex', m: 3 }}>
            <Paper elevation={2} style={{ width: "100%", textAlign: "center", fontSize: 36 }}>
                HOME
            </Paper>
        </Box>
        <Box sx={{ display: 'flex', m: 3 }}>
            <Paper elevation={3} style={{ width: "100%"}}>
                <Container maxWidth="md">
                    <h1 style={{textAlign: "center"}}>ระบบบันทึกผลกการวินิจฉัย</h1>
                    <h4><u>Requirements</u></h4>
                    <p>
                        ระบบบันทึกผลกการวินิจฉัยเป็นระบบที่แพทย์ใช้บันทึกผลการวินิจฉัยของผู้ป่วย โดยจะมี
                        การบันทึกข้อมูลที่เกี่ยวข้อง เช่น ประวัติของผู้ป่วยโดยสังเขป การตรวจร่างกาย วันที่เข้า
                        มารักษา เพื่อใช้ประกอบการวินิจฉัยโรค หลังจากทำการวินิจฉัยเสร็จแพทย์จะลงบันทึกผล
                        การวินิจฉัยว่าผู้ป่วยป่วยเป็นโรคอะไร และต้องทำการรักษาอย่างไรต่อไป 
                    </p>
                    <br />
                    <h4><u>User Story</u> (ระบบบันทึกผลกการวินิจฉัย)</h4>
                    <p>
                        <b>ในบทบาทของ</b>	แพทย์<br />
                        <b>ฉันต้องการ</b>	เก็บข้อมูลการวินิจฉัยอาการของผู้ป่วย<br />
                        <b>เพื่อ</b>	นำไปใช้ประกอบการรักษา และการจ่ายยาเพื่อรักษาโรค<br />
                    </p>
                </Container>
            </Paper>
            <Paper elevation={2} style={{ width: "100%"}}>
                <Container maxWidth="md">
                    <h1 style={{textAlign: "center"}}>ระบบจัดเก็บข้อมูลการรักษา</h1>
                    <h4><u>Requirements</u></h4>
                    <p>
                    ระบบจัดเก็บข้อมูลการรักษาเป็นระบบที่ใช้เก็บประวัติการรักษาของผู้ป่วยที่มาเข้ารับการรักษาในแต่ละครั้ง
                    โดยหลังจากที่ทำการรักษาเสร็จแล้ว แพทย์จะทำการบันทึกข้อมูลการรักษาที่ประกอบด้วย วันที่ผู้ป่วยเข้า
                    รับการักษา ผลการวินิจฉัย วิธีการรักษา การจ่ายยาให้ผู้ป่วย และนัดหมายเพื่อติดตามอาการ เพื่อเก็บไว้
                    เป็นประวัติการรักษาของผู้ป่วยในการเข้ารับการรักษาในครั้งต่อไป
                    </p>
                    <br />
                    <h4><u>User Story</u> (ระบบจัดเก็บข้อมูลการรักษา)</h4>
                    <p>
                        <b>ในบทบาทของ</b>	แพทย์<br />
                        <b>ฉันต้องการ</b>	บันทึกข้อมูลการรักษาผู้ป่วย<br />
                        <b>เพื่อ</b>	เก็บเป็นประวัติการรักษาของผู้ป่วย<br />
                    </p>
                </Container>
            </Paper>
        </Box>
        </>
    )
}

export default Home;